tap 'homebrew/cask-versions'

brew 'ack'
brew 'ag'
brew 'aspell'
brew 'bat'
brew 'colordiff'
brew 'colormake'
brew 'colortail'
brew 'fasd'
brew 'ffmpeg'
brew 'fortune'
brew 'global'
brew 'gpg'
brew 'jenv'
brew 'mas'
brew 'nodenv'
brew 'openssl'
brew 'pandoc'
brew 'postgres'
brew 'pyenv'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'sox'
brew 'sqlite'
brew 'unrar'
brew 'wget'
brew 'youtube-dl'
brew 'zsh'

cask 'arq'
cask 'atom'
cask 'beamer'
cask 'brave-browser'
cask 'dash'
cask 'discord'
cask 'expressvpn'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'fsmonitor'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'grandperspective'
cask 'hammerspoon'
cask 'id3-editor'
cask 'intel-power-gadget'
cask 'istat-menus5'
cask 'iterm2'
cask 'java'
cask 'licecap'
cask 'safari-technology-preview'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'transmission'
cask 'virtualbox'
cask 'vlc'
cask 'zoomus'

# Specific taps
#
tap 'thoughtbot/formulae'
brew 'rcm'

tap 'd12frosted/emacs-plus'
brew 'emacs-plus'

# Homebrew Fonts
#
tap 'caskroom/fonts'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-fantasque-sans-mono'

# Mac App Store
#
# `mas list`
#
mas '1Password', id: 443987910
mas 'Agenda', id: 1287445660
