tap 'homebrew/cask-versions'

brew 'ack'
brew 'ag'
brew 'aspell'
brew 'bat'
brew 'cocoapods'
brew 'colordiff'
brew 'colormake'
brew 'colortail'
brew 'dnsmasq'
brew 'docker'
brew 'docker-compose'
brew 'fasd'
brew 'ffmpeg'
brew 'fortune'
brew 'git'
brew 'git-lfs'
brew 'global'
brew 'gnupg'
brew 'graphviz'
brew 'grep'
brew 'htop'
brew 'imagemagick'
brew 'jansson'
brew 'jenv'
brew 'jump'
brew 'kubernetes-cli'
brew 'mas'
brew 'nodenv'
brew 'node-build'
brew 'openssl'
brew 'p7zip'
brew 'pandoc'
brew 'postgres'
brew 'pyenv'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'redis'
brew 'sox'
brew 'sqlite'
brew 'telnet'
brew 'terminal-notifier'
brew 'unrar'
brew 'watchman'
brew 'wget'
brew 'wrk'
brew 'youtube-dl'
brew 'zlib'
brew 'zsh'

cask 'arduino'
cask 'arq'
cask 'atom'
cask 'audiobookbinder'
cask 'beamer'
cask 'brave-browser'
cask 'chromedriver'
cask 'dash'
cask 'docker'
cask 'discord'
cask 'expressvpn'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'fsmonitor'
cask 'github'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'grandperspective'
cask 'hammerspoon'
cask 'id3-editor'
cask 'insomnia'
# cask 'intel-power-gadget'
# cask 'istat-menus5'
cask 'iterm2'
cask 'java'
cask 'licecap'
cask 'mongodb-compass-community'
cask 'phantomjs'
cask 'psequel'
cask 'safari-technology-preview'
cask 'sketch'
cask 'skype'
cask 'slack'
# cask 'spotify'
cask 'tableplus'
cask 'tor-browser'
cask 'transmission'
cask 'virtualbox'
cask 'vlc'
cask 'webtorrent'
cask 'zeplin'
cask 'zoomus'

# Specific taps
#
tap 'thoughtbot/formulae'
brew 'rcm'

tap 'd12frosted/emacs-plus'
brew 'emacs-plus'

tap 'heroku/brew'
brew 'heroku'

tap 'mongodb/brew'
brew 'mongodb-community-compass'

# OpenJDK 8 for use with android-studio
# tap 'AdoptopenJDK/openjdk'
# cask 'adoptopenjdk8'

# Homebrew Fonts
#
tap 'caskroom/fonts'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-fantasque-sans-mono'

# Mac App Store
#
# `mas list`
#
mas 'Agenda', id: 1287445660
mas 'Browser Ninja', id: 995838410
mas 'GarageBand', id: 682658836
mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Swiftify for Xcode', id: 1183412116
mas 'Xcode', id: 497799835